{
  "001ub": {
    "name": "Чулан в подземелье",
    "text": "-Зориан...\n-Зориан...\n Мальчик пришел в себя в знакомой ему каморке, куда никто не догадался заглянуть, Зориан поднялся с пола и ...",
    "options": [
      {
        "text": "...смело вышел из каморки навстречу опасности и приключению!",
        "result": {
          "response": { "text": "" },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c008" ]
            }
          }
        }
      },
      {
        "text": "...хитро ухмыльнувшись, отворил дверь и отправился на поиски возможнотей.",
        "result": {
          "response": { "text": "" },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c005" ]
            }
          }
        }
      },
      {
        "text": "...со злостью распахнул дверь, не собираясь сдаваться без боя!",
        "result": {
          "response": { "text": "" },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c006" ]
            }
          }
        }
      },
      {
        "text": "...осторожно выглянул наружу, не собираясь совершать необдуманных поступков.",
        "result": {
          "response": { "text": "" },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c007" ]
            }
          }
        }
      }
    ]
  },

  "002ub": {
    "name": "Патруль в подземелье",
    "text": "Зориан быстро шел по вновь переменившимся коридорам замка, как вдруг услышал глухие шаги за спиной, обернувшись, юный маг увидел послушника в темном балахоне.",
    "options": [
      {
        "text": "Зориан вскинул руки, формируя магические печати и бросился в бой!",
        "result": {
          "response": { "text": "Послушник темного лорда поднял дрожащие руки и принял боевую стойку." },
          "fight": {
            "who": "Acolyte_easy",
            "reward_win": {
              "response": { "text": "Потерявший сознание послушник остался лежать на земле, а зориан двинулся дальше, чувствуя, что научился в этом бою новым трюкам" },
              "stats": {
                "gold": 10
              },
              "card": {
                "give_choice": true,
                "how": {
                  "type": "random_different",
                  "amount": 3
                },
                "from": {
                  "type": "tag",
                  "tags": [ "common" ]
                }
              }
            }
          }
        }
      }
    ]
  },

  "003ub": {
    "name": "Друг в беде: Гоблины",
    "text": "Из класса сбоку послышались звуки борьбы и Зориан, заглянув внутрь, увидел нескольких гоблинов в темных доспехах, нападающих на его однокурсника Таргена, который отбивался от них, бросая огненные метеоры. Обстановка внутри подземной аудитории была в хаосе, столы и стулья перевернуты, а на них уже загорались первые признаки пожара.",
    "options": [
      {
        "text": "-Отстаньте от моего друга! - Зориан вбежал в класс, активируя свои заклинания и бросился на защиту однокурсника.",
        "result": {
          "response": { "text": "-Бугагага! - гоблины повернулись на нового врага и в Зориана полетели ответные атаки." },
          "fight": {
            "who": "Goblins",
            "reward_win": {
              "response": { "text": "Отбивишись от гоблинов и потушив пламя, Зориан и Тарген вышли из класса." },
              "alignment": {
                "light": 2
              },
              "card": {
                "give_choice": false,
                "how": {
                  "type": "all"
                },
                "from": {
                  "type": "specific",
                  "ids": [ "c018" ]
                }
              }
            }
          }
        }
      },
      {
        "text": "-Вы поплатитесь за то, что напали на нашу школу! - Зориан вбежал в класс, активируя свои заклинания и бросился на смешавшихся гоблинов.",
        "result": {
          "response": { "text": "Гоблины повернулись на нового врага и неуверенно отправили в него свои чары." },
          "fight": {
            "who": "Goblins",
            "reward_win": {
              "response": { "text": "Отбивишись от гоблинов, Зориан и Тарген вышли из пылающего класса, не теряя время чтобы потушить его." },
              "alignment": {
                "fire": 2
              },
              "card": {
                "give_choice": false,
                "how": {
                  "type": "all"
                },
                "from": {
                  "type": "specific",
                  "ids": [ "c018" ]
                }
              }
            }
          }
        }
      },
      {
        "text": "Зориан спокойно зашел внутрь аудитории, и бросил на пол кошель с монетами. -Жалкие существа, если вы не хотите пасть от моей руки, служите мне!",
        "result": {
          "response": {},
          "probability": {
            "success": {
              "probability": "dark*dark/25",
              "result": {
                "response": { "text": "-Что ты делаешь, они же враги! -Тарген, не веря своим глазам опустил стену огня, когда гоблины медленно поклонились Зориану, а один из них быстро подобрал мешочек денег с пола. Тарген как ужаленный выскочил из класса, в ужасе оглядываясь на Зориана и его новых слуг." },
                "alignment": {
                  "dark": 2
                },
                "stats": {
                  "gold": -100
                },
                "card": {
                  "give_choice": true,
                  "how": {
                    "type": "random_different",
                    "amount": 3
                  },
                  "from": {
                    "type": "tag",
                    "tags": [ "common", "rare", "dark" ]
                  }
                }
              }
            },
            "failure": {
              "probability": "1-dark*dark/25",
              "result": {
                "response": { "text": "-Бугагага! - гоблины повернулись на самоуверенного мага и бросились в атаку, впрочем один из них не забыл походя подобрать мешочек с золотыми монетами." },
                "alignment": {
                  "dark": 1
                },
                "stats": {
                  "gold": -100
                },
                "fight": {
                  "who": "Goblins",
                  "reward_win": {
                    "response": { "text": "Отбивишись от гоблинов, Зориан и Тарген выскочили из пылающего класса. Однокурсник хмуро посмотрел на Зориана, -Не думай, что я не слышал, что ты пытался сделать. - после этих слов Тарген скрылся в одном из проходов." }
                  }
                }
              }
            }
          }
        }
      }
    ]
  },
  "004ub": {
    "name": "Друг в беде: Зомби",
    "text": "Коридор перед Зорианом оказался заполнен толпой живых мертвецов, ориентирующиеся на слух, монстры плотно обступили замершего в центре толпы однокурсника Зориана - Исвальда. Тот медленно поднимал вокруг себя ледяную стену, так тихо и медленно, чтобы зомби не среагировали на него.",
    "options": [
      {
        "text": "Зориан вспомнил уроки некромантии, начертил на полу магическую печать и начал ритуал подчинения нежити.",
        "result": {
          "response": {},
          "probability": {
            "success": {
              "probability": "dark*dark/25",
              "result": {
                "response": { "text": "Невзирая на взгляды отвращения Исвальда, Зориан довел ритуал до конца, зомби подчинились своему новому хозяину и медленно пошли к нему, а Исвальд, не теряя времени зря, рванул в противоположную сторону и скрылся в темноте переходов." },
                "alignment": {
                  "dark": 2
                },
                "card": {
                  "give_choice": false,
                  "how": {
                    "type": "all"
                  },
                  "from": {
                    "type": "specific",
                    "ids": [ "c028" ]
                  }
                }
              }
            },
            "failure": {
              "probability": "1-dark*dark/25",
              "result": {
                "response": { "text": "Зориан почувствовал, что его сил не хватает, чтобы справится с такой толпой, зомби медленно двинулись на него, а Исвальд, глядя на некроманта с отвращением, медленно отполз назад и бросился бежать в противоположном направлении." },
                "alignment": {
                  "dark": 1
                },
                "fight": {
                  "who": "Zombie",
                  "reward_win": {
                    "response": { "text": "Расправившись с мертвецами, Зориан перевел дыхание и побрел дальше. Он и не заметил, как за ним по полу поползла отрубленная рука одного из монстров" },
                    "card": {
                      "give_choice": false,
                      "how": {
                        "type": "all"
                      },
                      "from": {
                        "type": "specific",
                        "ids": [ "c028" ]
                      }
                    }
                  }
                }
              }
            }
          }
        }
      },
      {
        "text": "Зориан вспомнил уроки защиты от темных исскуств, и сложил руки в сложном жесте, начиная ритуал изгнания нежити.",
        "result": {
          "response": {},
          "probability": {
            "success": {
              "probability": "light*light/25",
              "result": {
                "response": { "text": "Когда последний зомби пал на пол коридора, Зориан подбежал к Исвальду и помог тому выбраться из ледяной темницы. Парни двинулись дальше вместе." },
                "alignment": {
                  "light": 2
                },
                "card": {
                  "give_choice": false,
                  "how": {
                    "type": "all"
                  },
                  "from": {
                    "type": "specific",
                    "ids": [ "c024" ]
                  }
                }
              }
            },
            "failure": {
              "probability": "1-light*light/25",
              "result": {
                "response": { "text": "Спустя пару мгновений Зориан понял, что его сил не хватает и бросив хмурый взгляд на мертвецов, принялся готовиться к бою" },
                "alignment": {
                  "light": 1
                },
                "fight": {
                  "who": "Zombie",
                  "reward_win": {
                    "response": { "text": "Когда последний зомби пал на пол коридора, Зориан подбежал к Исвальду и помог тому выбраться из ледяной темницы. Парни двинулись дальше вместе." },
                    "card": {
                      "give_choice": false,
                      "how": {
                        "type": "all"
                      },
                      "from": {
                        "type": "specific",
                        "ids": [ "c024" ]
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    ]
  },

  "005ub": {
    "name": "Пир духов",
    "text": "Зориан прокрался в большой подземный зал и увидел разнообразных духов и призраков, которые заполонили пространство с пола до потолка. Юные духи играли тут в догонялки, призраки постарше пугали друг друга, а самые большие приведения ожесточенно спорили о древней истории. Юный маг вошел внутрь и...",
    "options": [
      {
        "text": "...решил немного отдохнуть с юными призраками",
        "result": {
          "response": { "text": "Покружившись с юными призраками, Зориан почувствовал себя отдохнувшим, а несколько из них даже увязалось за ним." },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c001", "c001" ]
            }
          },
          "stats": {
            "energy": 3
          }
        }
      },
      {
        "text": "...собрался поупражняться в компании зрелых духов",
        "result": {
          "response": { "text": "Призраки показали Зориану несколько новых страшилок, а тот, пока общался с ними, неплохо отдохнул." },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c002", "c002" ]
            }
          },
          "stats": {
            "energy": 3
          }
        }
      },
      {
        "text": "...направился к старейшим привидениям, чтобы поднабраться у них опыта",
        "result": {
          "response": { "text": "Зориан быстро ввязался в громкую дискуссию с двумя большими духами, они разошлись не на шутку, но на удивление, сам волшелбник после этого почувствовал себя лучше. Стресс немного отступил и Зориан был готов дивгаться дальше." },
          "card": {
            "give_choice": false,
            "how": {
              "type": "all"
            },
            "from": {
              "type": "specific",
              "ids": [ "c003", "c003" ]
            }
          },
          "stats": {
            "energy": 3
          }
        }
      }
    ]
  },

  "006ub": {
    "name": "Подъем наверх",
    "text": "Порядком устав от извилистых корридоров подземелья, Зориан свернул за очередной угол. Но в этот раз перед ним, всего в сотне шагов впереди виднелся подъем наверх. Зориан радостно бросился вперед, как вдруг, с потолка, будто бы разрушая все надежды мага, рухнуло темное тело. \n -Еще один жалкий колдунишка! Я съем и тебя!",
    "options": [
      {
        "text": "Зориан уже видел таких созданий. Волосатых, звероподобных и черных как сама ночь. Перед ним был оборотень, одна из самых опасных тварей на службе темных сил. Но Зориан не мог отступить и с его ладоней уже срывались первые чары.",
        "result": {
          "response": { "text": "Вервольф с жутким воем понесся на Зориана, параллельно выкрикивая слова проклятий и подвываяю" },
          "fight": {
            "who": "Werewolf",
            "reward_win": {
              "response": { "text": "Окровавленное тело, вернувшееся к своему изначальному облику опало на каменный пол перед магом, который отправился вперед, ведь ему предстоял еще долгий путь..." },
              "alignment": {
                "light": 1,
                "dark": 1,
                "fire": 1,
                "ice": 1
              },
              "card": {
                "give_choice": true,
                "how": {
                  "type": "random_different",
                  "amount": 3
                },
                "from": {
                  "type": "tag",
                  "tags": [ "legendary" ]
                },
                "result": {
                  "win": {
                  }
                }
              }
            }
          }
        }
      }
    ]
  },

  "001cb": {
    "name": "Забытый сундук",
    "text": "Зориан заглянул в пустой класс и увидел древний деревянный сундук, оставленный кем-то. Сундук был заперт и будто манил юношу к себе...",
    "options": [
      {
        "text": "Зориан решил, что брать содержимое чужого сундука - плохо и прошел мимо.",
        "result": {
          "response": { "text": "..." },
          "alignment": {
            "light": 1
          }
        }
      },
      {
        "text": "Зориан, ухмыльнувшись, взмахнул руками, приготовившись взломать сундук темным проклятием.",
        "result": {
          "response": {},
          "probability": {
            "success": {
              "probability": "dark/5",
              "result": {
                "response": { "text": "Два темных щупальца под чутким контролем юного чернокнижника пробрались в замок и повернули механизм. Зориан гордо извлек из недр сундука мешочек золота и свиток с заклинанием." },
                "alignment": {
                  "dark": 1
                },
                "stats": {
                  "gold": 50
                },
                "card": {
                  "give_choice": true,
                  "how": {
                    "type": "random_different",
                    "amount": 3
                  },
                  "from": {
                    "type": "tag",
                    "tags": [ "common" ]
                  }
                }
              }
            },
            "failure": {
              "probability": "1-dark/5",
              "result": {
                "response": { "text": "Два темных щупальца под контролем юного чернокнижника пробрались в замок и с громким шипением вспыхнули, корчась от боли и пламени, охватившего сундук, когда активировались защитные чары." },
                "alignment": {
                  "dark": 1
                },
                "stats": {
                  "health": -10
                }
              }
            }
          }
        }
      },
      {
        "text": "Зориан, ни секунды ни сомневаясь, вызвал огненные чары и метнул сгусток пламени в сундук, намереваясь забрать все, что уцелеет, у него не было ни времени ни желания бороться с замком.",
        "result": {
          "response": {},
          "probability": {
            "success": {
              "probability": 30,
              "result": {
                "response": { "text": "Не дожидаясь пока пламя потухнет, пиромант извлек из останков сундука обгоревший мешочек с золотыми монетами." },
                "alignment": {
                  "fire": 2
                },
                "stats": {
                  "gold": 50
                }
              }
            },
            "failure": {
              "probability": 70,
              "result": {
                "response": { "text": "Пламя охватившее сундук, активировало защитный механизм, отбросивший магию обратно в пироманта. Юноша смог таки сжечь проклятый сундук, отделавшись парой новых ожогов.\n На останках сундука он заметил чудом уцелевший магический свиток." },
                "alignment": {
                  "fire": 2
                },
                "stats": {
                  "health": -10
                },
                "card": {
                  "give_choice": true,
                  "how": {
                    "type": "random_different",
                    "amount": 3
                  },
                  "from": {
                    "type": "tag",
                    "tags": [ "common" ]
                  }
                }
              }
            }
          }
        }
      },
      {
        "text": "Зориан посчитал, что это наверняка ловушка, а даже если нет - хозяин может скоро вернуться и прошел мимо.",
        "result": {
          "response": { "text": "..." },
          "alignment": {
            "ice": 1
          }
        }
      }
    ]
  },

  "002cb": {
    "name": "Призрак кровавого барона",
    "text": "Зориан завернул в темный узкий проход, который по четвергам вел в кабинет зельеварения, а в полнолуние выводил куда-то за пределы замка\n Юноша почувствовал знакомый мороз, пробежавший по коже и ускорил шаг, надеясь, что наваждение пройдет. Однако из стены, перекрывая путь Зориана выплыл призрак кровавого барона - мужчины в богатом костюме и с оголенной саблей.\n -Хаос спустился на академию! А хаос, это время набивать карманы! Отдавай деньги по хорошему и возможно я отпущу тебя!",
    "options": [
      {
        "text": "Нехотя, Зориан кинул призраку кошель монет, чтобы тот отвязался, ему совсем не хотелось тратить время на приставучего барона и его сентиментальные игры. Деньги магическим образом исчезли, коснувшись ладони призрака.",
        "result": {
          "response": { "text": "Барон жутко рассмеялся, размахивая саблей направо и налево.\n -Хорошо, хорошо, парень. Я чувствую себя снова живым, когда граблю людей. Держи подарок, я сегодня щедрый!" },
          "alignment": {
            "ice": 1
          },
          "card": {
            "give_choice": true,
            "how": {
              "type": "random_different",
              "amount": 3
            },
            "from": {
              "type": "tag",
              "tags": [ "common" ]
            }
          }
        }
      },
      {
        "text": "-У меня нет денег для тебя, призрак. - Зориан приготовился к тяжелому бою, не рассчитывая на милость кровавого барона.",
        "result": {
          "response": { "text": "Барон жутко рассмеялся, размахивая саблей направо и налево.\n -Хорошо, хорошо, парень, так даже лучше, я чувствую себя снова живым, когда могу размять свою эктоплазму!" },
          "fight": {
            "who": "Ghost_hard",
            "reward_win": {
              "response": { "text": "Призрак, сильно потускнев, опустился к земле, истощив свои запасы магии. -Ты хорошо сражаешься, каналья. Ты заслужил награду за то, что повеселил старика." },
              "alignment": {
                "fire": 1
              },
              "card": {
                "give_choice": true,
                "how": {
                  "type": "random_different",
                  "amount": 3
                },
                "from": {
                  "type": "tag",
                  "tags": [ "common" ]
                }
              }
            }
          }
        }
      }
    ]
  },

  "002cd": {
    "name": "Призрак кровавого барона",
    "text": "Зориан завернул в темный узкий проход, который по четвергам вел в кабинет зельеварения, а в полнолуние выводил куда-то за пределы замка. Юноша почувствовал знакомый мороз, пробежавший по коже, и замедлил шаг, ощущая присутствие темной сущности. Из стены, перекрывая путь Зориана, выплыл призрак кровавого барона - мужчины в богатом костюме и с оголенной саблей.\n -Я почувствовал что-то темное в этом коридоре и кого же я вижу... Юный адепт темных исскуств, похвально, юноша, приятно видеть, что не все современные волшебники - белоручки. Пожалуй я могу поделиться с тобой крупицей своей былой силы. Скажи, чего ты желаешь?",
    "options": [
      {
        "text": "-Научи меня темнейшим чарам, Кровавый Барон! -Зориан выпалил это, не задумываясь ни на секунду.",
        "result": {
          "response": { "text": "Барон жутко рассмеялся, размахивая саблей направо и налево.\n -О, да, именно так должен отвечать чернокнижник жаждущий силы! Я покажу тебе одно из моих лучших заклятий." },
          "alignment": {
            "dark": 1
          },
          "card": {
            "give_choice": true,
            "how": {
              "type": "random_different",
              "amount": 3
            },
            "from": {
              "type": "tag",
              "tags": [ "dark", "rare" ]
            }
          }
        }
      },
      {
        "text": "-Сделай мои темные заклятья сильнее, Кровавый призрак! -произнес Зориан, немного растягивая слова.",
        "result": {
          "response": { "text": "Барон жутко рассмеялся, размахивая саблей направо и налево.\n -А ты знаешь толк в магии, аколит! Пусть эта вещь послужит тебе так же как и мне когда-то." },
          "alignment": {
            "dark": 3
          }
        }
      }
    ]
  },

  "003cb": {
    "name": "Подвал зельевара",
    "text": "Проходя мимо подвала, в котором школьный зельевар хранил свои запасы, Зориан не смог удержать себя от того, чтобы заглянуть внутрь. Любопытство взяло вверх и Зориан через мгновение уже стоял внутри небольшого душного помещения, заваленного свитками и реагентами.",
    "options": [
      {
        "text": "Зориан холодно умехнулся, думая, какое лицо было бы у зельевара, если бы тот узнал, что Зориан сейчас грабит его запасы. Маг решил осмотреться в поисках чего-нибудь, что могло бы помочь ему и охладить пыл его врагов.",
        "result": {
          "response": { "text": "Через несколько минут поисков, на глаза волшебнику попался резной сундучок, в котором Зориан обнаружил хитрую магическую формулу." },
          "alignment": {
            "ice": 1
          },
          "card": {
            "give_choice": true,
            "how": {
              "type": "random_different",
              "amount": 3
            },
            "from": {
              "type": "tag",
              "tags": [ "ice", "common" ]
            }
          }
        }
      },
      {
        "text": "Зориан обвел глазами каморку, думая, как часто он хотел пробраться сюда, просто чтобы позлить школьного зельевара. Маг решил осмотреться в поисках чего-нибудь, что могло бы подогреть интерес его противников к быстрой капитуляции.",
        "result": {
          "response": { "text": "Через несколько минут поисков, на глаза волшебнику попался резной сундучок, в котором Зориан обнаружил хитрую магическую формулу." },
          "alignment": {
            "fire": 1
          },
          "card": {
            "give_choice": true,
            "how": {
              "type": "random_different",
              "amount": 3
            },
            "from": {
              "type": "tag",
              "tags": [ "fire", "common" ]
            }
          }
        }
      }
    ]
  },

  "004cb": {
    "name": "Великий волшебник",
    "text": "Зориан устало шел по очередному коридору, когда перед его глазами оказался портрет древнего великого волшебника, по прихоти директора, оказавшийся на этом месте. \n -Ну наконец. В эти темные времена нашелся достойный герой, который сможет спасти нашу школу. У меня есть для тебя достойный дар, юноша.",
    "options": [
      {
        "text": "Зориан удивленно посмотрел на портрет, с которым никогда даже не разговаривал.",
        "result": {
          "response": { "text": "Древний маг на портрете тем временем взмахнул руками и портрет отъехал в сторону открывая небольшой тайник, в котором лежал не менее древний свиток" },
          "alignment": {
            "light": 1
          },
          "card": {
            "give_choice": true,
            "how": {
              "type": "random_different",
              "amount": 3
            },
            "from": {
              "type": "tag",
              "tags": [ "legendary" ]
            }
          }
        }
      }
    ]
  },

  "004cd": {
    "name": "Великий волшебник",
    "text": "Зориан устало шел по очередному коридору, когда перед его глазами оказался портрет древнего великого волшебника, по прихоти директора, оказавшийся на этом месте. \n -Еще одно отродье тьмы. Ты противен мне, также как и остальные захватчики! Убирайся!",
    "options": [
      {
        "text": "Зориан удивленно посмотрел на портрет, с которым никогда даже не разговаривал.",
        "result": {
          "response": { "text": "Древний маг на портрете тем временем взмахнул руками и c портрета в Зориана полетел светящий шар энергии. Зориана буквально отшвырнуло дальше по коридору и он решил больше не возвращаться к этому взбаломошному старику." },
          "stats": {
            "health": -20
          }
        }
      }
    ]
  },

  "id": {
    "name": "...",
    "text": "...",
    "options": []
  }
}